modules/+fancy-org-mode.org
#+TITLE:  Emacs Org-Mode Settings
#+AUTHOR: Xing Wenjus
#+EMAIL:  xingwenju@gmail.com
#+TAGS:   emacs org-mode
#+startup: overview

* 我的org设置
** 基本配置
*** 内部启动配置
#+BEGIN_SRC elisp

  (use-package org
    :bind (("C-c l" . org-store-link)
	   ("C-c c" . org-capture)
	   ("C-c a" . org-agenda)
	   ("C-c L" . org-insert-link-global)
	   ("C-c O" . org-open-at-point-global)
	   ("C-M-|" . indent-rigidly))
    :config
    (setq org-todo-keywords '((sequence "[学习](s!/@)" "[待办](t!/@)" "[等待](w!))" "|" "[完成](d!/@)" "[取消](c!@)")
                       (sequence "[BUG](b!/@)" "[新事件](i/@)" "[已知问题](k!/@)" "[修改中](W!/@)" "|" "[已修复](f!)"))) 
    (setq org-todo-keyword-faces '(("[学习]" . (:foreground "white" :background "#2ECC71" :weight bold))
								 ("[待办]" . (:foreground "white" :background "#F1C40F" :weight bold))
								 ("[等待]" . (:foreground "white" :background "#3498DB" :weight bold))
								 ("[完成]" . (:foreground "black" :background "snow " :weight bold))
								 ("[取消]" . (:foreground "white" :background "#566573" :weight bold))
								 ("[BUG]" . (:foreground "white" :background "#E74C3C" :weight bold))
								 ("[新事件]" . (:foreground "white" :background "#D35400" :weight bold))
								 ("[已知问题]" . (:foreground "white" :background "#17A589" :weight bold))
								 ("[修改中]" . (:foreground "white" :background "#BB8FCE" :weight bold))
								 ("[已修复]" . (:foreground "white" :background "#566573" :weight bold))))
    (setq org-use-speed-commands t
	  org-return-follows-link t
	  org-hide-emphasis-markers t
	  org-completion-use-ido t
	  org-outline-path-complete-in-steps nil
	  org-src-fontify-natively t   ;; Pretty code blocks
	  org-src-tab-acts-natively t
	  org-confirm-babel-evaluate nil)
    ;; todo关键字

    (setq-default org-display-custom-times t)
    (setq org-time-stamp-custom-formats '("<%a %b %e %Y>" . "<%a %b %e %Y %H:%M>"))
    (setq org-columns-default-format "%80ITEM(Task) %10Effort(Effort){:} %10CLOCKSUM")
    (setq org-global-properties (quote (("Effort_ALL" . "0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 0:00")
					("STYLE_ALL" . "habit"))))
    (setq org-stuck-projects
	  '("TODO={.+}/-DONE" nil nil "SCHEDULED:\\|DEADLINE:"))
    ;; Config refile targets
    (setq org-refile-use-outline-path 'file)
    (setq org-outline-path-complete-in-steps nil)
    (setq org-refile-targets
	  '((nil :maxlevel . 4)
	    (org-agenda-files :maxlevel . 4)))

    (add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\|txt\\)$" . org-mode))
    (add-to-list 'auto-mode-alist '(".*/[0-9]*$" . org-mode))   ;; Journal entries
    (add-hook 'org-mode-hook #'auto-fill-mode)
    (add-hook 'org-mode-hook 'yas-minor-mode-on)
    (define-key org-mode-map (kbd "M-C-n") 'org-end-of-item-list)
    (define-key org-mode-map (kbd "M-C-p") 'org-beginning-of-item-list)
    (define-key org-mode-map (kbd "M-C-u") 'outline-up-heading)
    (define-key org-mode-map (kbd "M-C-w") 'org-table-copy-region)
    (define-key org-mode-map (kbd "M-C-y") 'org-table-paste-rectangle)
    (define-key org-mode-map [remap org-return] (lambda () (interactive)
						  (if (org-in-src-block-p)
						      (org-return)
						    (org-return-indent)))))
#+END_SRC

#+RESULTS:
: indent-rigidly

*** 定义标签列表
#+BEGIN_SRC elisp

(use-package org
   :config
   (setq org-fast-tag-selection-single-key (quote expert))
   (setq org-tag-alist (quote ((:startgroup)
			       ("@office" . ?o)
			       ("@home" . ?h)
			       ("@travel" . ?t)
			       ("@errand" . ?e)
			       ("party" . ?1)
			       ("finance" . ?2)
			       ("public" . ?3)
			       ("hr" . ?4)
			       ("protocol" . ?5)
			       ("class" . ?6)
			       ("security" . ?7)
			       ("enterprise" . ?8)
			       (:endgroup)
			       ("PERSONAL" . ?p)
			       ("KIDS" . ?k)
			       ("DANIEL" . ?d)
			       ("LULU" . ?l)
			       ("WORK" . ?W)
			       ("PROJECT" . ?P)
			       ("COMPUTER" . ?C)
			       ("PHONE" . ?E)
			       ("HABIT" . ?H)
			       )))
  )


#+END_SRC

#+RESULTS:
: t

*** 链接缩略词
    #+BEGIN_SRC elisp
  (add-to-list 'org-link-abbrev-alist
            '("github"      . "https://github.com/%s"))
  (add-to-list 'org-link-abbrev-alist
            '("youtube"     . "https://youtube.com/watch?v=%s"))
  (add-to-list 'org-link-abbrev-alist
            '("google"      . "https://google.com/search?q="))
  (add-to-list 'org-link-abbrev-alist
            '("gimages"     . "https://google.com/images?q=%s"))
  (add-to-list 'org-link-abbrev-alist
            '("gmap"        . "https://maps.google.com/maps?q=%s"))
  (add-to-list 'org-link-abbrev-alist
            '("duckduckgo"  . "https://duckduckgo.com/?q=%s"))
  (add-to-list 'org-link-abbrev-alist
            '("wikipedia"   . "https://en.wikipedia.org/wiki/%s"))
  (add-to-list 'org-link-abbrev-alist
            '("wolfram"     . "https://wolframalpha.com/input/?i=%s"))
  (add-to-list 'org-link-abbrev-alist
            '("doom-repo"   . "https://github.com/hlissner/doom-emacs/%s"))

    #+END_SRC

    #+RESULTS:
    : ((doom-repo . https://github.com/hlissner/doom-emacs/%s) (wolfram . https://wolframalpha.com/input/?i=%s) (wikipedia . https://en.wikipedia.org/wiki/%s) (duckduckgo . https://duckduckgo.com/?q=%s) (gmap . https://maps.google.com/maps?q=%s) (gimages . https://google.com/images?q=%s) (google . https://google.com/search?q=) (youtube . https://youtube.com/watch?v=%s) (github . https://github.com/%s))

** Babel设置
*** 基本设置
#+BEGIN_SRC elisp

  (use-package ob-go :ensure t)
  (use-package ob-html-chrome :ensure t)
  (use-package ob-deno :ensure t)

  (use-package ox-hugo :ensure t)
  (use-package ox-gfm :ensure t)
  (use-package ox-reveal :ensure t)

  (eval-after-load 'org-src
      '(define-key org-src-mode-map
	 (kbd "C-x C-s") #'org-edit-src-exit))

#+END_SRC

#+RESULTS:
: org-edit-src-exit

*** 结构化模板

=<s[TAB]= 插入代码块

=<l= 插入Lisp代码块

#+begin_src elisp :tangle no
(setq org-structure-template-alist
	'(("s" "#+begin_src ?\n\n#+end_src" "<src lang=\"?\">\n\n</src>")
	("e" "#+begin_example\n?\n#+end_example" "<example>\n?\n</example>")
	("q" "#+begin_quote\n?\n#+end_quote" "<quote>\n?\n</quote>")
	("v" "#+BEGIN_VERSE\n?\n#+END_VERSE" "<verse>\n?\n</verse>")
	("c" "#+BEGIN_COMMENT\n?\n#+END_COMMENT")
	("p" "#+BEGIN_PRACTICE\n?\n#+END_PRACTICE")
	("l" "#+begin_src emacs-lisp\n?\n#+end_src" "<src lang=\"emacs-lisp\">\n?\n</src>")
	("L" "#+latex: " "<literal style=\"latex\">?</literal>")
	("h" "#+begin_html\n?\n#+end_html" "<literal style=\"html\">\n?\n</literal>")
	("H" "#+html: " "<literal style=\"html\">?</literal>")
	("a" "#+begin_ascii\n?\n#+end_ascii")
	("A" "#+ascii: ")
	("i" "#+index: ?" "#+index: ?")
	("I" "#+include %file ?" "<include file=%file markup=\"?\">")))
#+end_src

#+RESULTS:




This lets me nest quotes. http://emacs.stackexchange.com/questions/2404/exporting-org-mode-nested-blocks-to-html

#+begin_src elisp :tangle yes
(defun my/org-html-quote2 (block backend info)
(when (org-export-derived-backend-p backend 'html)
(when (string-match "\\`<div class=\"quote2\">" block)
(setq block (replace-match "<blockquote>" t nil block))
(string-match "</div>\n\\'" block)
(setq block (replace-match "</blockquote>\n" t nil block))
block)))
(eval-after-load 'ox
'(add-to-list 'org-export-filter-special-block-functions 'my/org-html-quote2))
#+end_src

#+RESULTS:
| my/org-html-quote2 |

