modules/+fancy-org-mode.el
(defun my/org-html-quote2 (block backend info)
(when (org-export-derived-backend-p backend 'html)
(when (string-match "\\`<div class=\"quote2\">" block)
(setq block (replace-match "<blockquote>" t nil block))
(string-match "</div>\n\\'" block)
(setq block (replace-match "</blockquote>\n" t nil block))
block)))
(eval-after-load 'ox
'(add-to-list 'org-export-filter-special-block-functions 'my/org-html-quote2))

(use-package org
  :config
