modules/+fancy-org-mode.org
*** 标题字体
#+BEGIN_SRC elisp

  (use-package org
    :config

    (set-face-attribute 'org-link nil
			:weight 'normal
			:background nil)
    (set-face-attribute 'org-code nil
			:foreground "#a9a1e1"
			:background nil)
    (set-face-attribute 'org-date nil
			:foreground "#5B6268"
			:background nil)
    (set-face-attribute 'org-level-1 nil
			:foreground "steelblue2"
			:background nil
			:height 1.1
			:weight 'normal)
    (set-face-attribute 'org-level-2 nil
			:foreground "slategray2"
			:background nil
			:height 1.0
			:weight 'normal)
    (set-face-attribute 'org-level-3 nil
			:foreground "SkyBlue2"
			:background nil
			:height 1.0
			:weight 'normal)
    (set-face-attribute 'org-level-4 nil
			:foreground "DodgerBlue2"
			:background nil
			:height 1.0
			:weight 'normal)
    (set-face-attribute 'org-level-5 nil
			:weight 'normal)
    (set-face-attribute 'org-level-6 nil
			:weight 'normal)
    (set-face-attribute 'org-document-title nil
			:foreground "SlateGray1"
			:background nil
			:height 1.25
			:weight 'bold)

    (setq org-list-demote-modify-bullet (quote (("+" . "-")
						("*" . "-")
						("1." . "-")
						("1)" . "-")
						("A)" . "-")
						("B)" . "-")
						("a)" . "-")
						("b)" . "-")
						("A." . "-")
						("B." . "-")
						("a." . "-")
						("b." . "-"))))
  )

#+END_SRC

#+RESULTS:
: t

*** 超级星号

    =superstar= 是用于美化每个星号图标

#+BEGIN_SRC elisp :tangle yes

  ;; (use-package org-noter :ensure t)
  ;; (use-package org-appear :ensure t)
  (use-package org-superstar
    :ensure t
    :after org
    :hook (org-mode . org-superstar-mode)
    :config
    (set-face-attribute 'org-superstar-header-bullet nil :inherit 'fixed-pitched :height 180)
    :custom
    (org-superstar-headline-bullets-list '("☀" "☪" "☯" "✿" "→"))
    (setq org-ellipsis " ▼ "))

#+END_SRC

#+RESULTS:
| yas-minor-mode-on | auto-fill-mode | org-superstar-mode | org-fancy-priorities-mode | org-bullets-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** 下载工具

#+BEGIN_SRC elisp
(use-package org-download :ensure t)
#+END_SRC

#+RESULTS:

** 日志工具

#+BEGIN_SRC elisp

(use-package org-journal
  :ensure t
  :defer t
  :init
  (add-to-list 'magic-mode-alist '(+org-journal-p . org-journal-mode))

  (defun +org-journal-p ()
    "Wrapper around `org-journal-is-journal' to lazy load `org-journal'."
    (when-let (buffer-file-name (buffer-file-name (buffer-base-buffer)))
      (if (or (featurep 'org-journal)
              (and (file-in-directory-p
                    buffer-file-name (expand-file-name org-journal-dir org-directory))
                   (require 'org-journal nil t)))
          (org-journal-is-journal))))

  (setq org-journal-dir (dropbox-path "org/journal/")
        org-journal-cache-file (dropbox-path "org/journal/"))

  :config
  ;; Remove the orginal journal file detector and rely on `+org-journal-p'
  ;; instead, to avoid loading org-journal until the last possible moment.
  (setq magic-mode-alist (assq-delete-all 'org-journal-is-journal magic-mode-alist))

  ;; Setup carryover to include all configured TODO states. We cannot carry over
  ;; [ ] keywords because `org-journal-carryover-items's syntax cannot correctly
  ;; interpret it as anything other than a date.
  (setq org-journal-carryover-items  "TODO=\"TODO\"|TODO=\"PROJ\"|TODO=\"STRT\"|TODO=\"WAIT\"|TODO=\"HOLD\""))

#+END_SRC

#+RESULTS:
: t

** 番茄闹钟

#+BEGIN_SRC elisp
(use-package org-pomodoro
  :ensure t
  :config
  (with-eval-after-load 'org-pomodoro
    ;; prefer PulseAudio to ALSA in $current_year
    (setq org-pomodoro-audio-player (or (executable-find "paplay")
					org-pomodoro-audio-player))

    ;; configure pomodoro alerts to use growl or libnotify
    (alert-add-rule :category "org-pomodoro"
		    :style (cond (alert-growl-command
				  'growl)
				 (alert-notifier-command
				  'notifier)
				 (alert-libnotify-command
				  'libnotify)
				 (alert-default-style)))))
#+END_SRC

#+RESULTS:
: t

** Elfeed
 #+BEGIN_SRC elisp
 (use-package elfeed-org
    :config
       (setq rmh-elfeed-org-files (list
			       (concat org-directory "/elfeed1.org")
			       (concat org-directory "/elfeed2.org")))
   (setq elfeed-db-directory (concat org-directory "/elfeed/db/"))
   (setq elfeed-enclosure-default-dir (concat org-directory "/elfeed/enclosures/"))
   (setq elfeed-search-filter "@3-month-ago +unread")
 )
 #+END_SRC

 #+RESULTS:
 : t
** Reveal展示

#+BEGIN_SRC elisp
(use-package ox-reveal
  :init
  (setq org-reveal-root (dropbox-path "shared/ppt/reveal.js"))
  (setq org-reveal-postamble "Xing Wenju"))
#+END_SRC

#+RESULTS:

#+DESCRIPTION: 使用文学编程，对org模式进行终极设置 

#+PROPERTY:    header-args:elisp  :tangle ~/EnvSetup\config\evil-emacs/modules/+fancy-org-mode.el
#+PROPERTY:    header-args:sh     :tangle no
#+PROPERTY:    header-args:       :results silent   :eval no-export   :comments org

#+OPTIONS:     num:nil toc:nil todo:nil tasks:nil tags:nil
#+OPTIONS:     skip:nil author:nil email:nil creator:nil timestamp:nil
#+INFOJS_OPT:  view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js

