modules/+fancy-org-mode.el

  (set-face-attribute 'org-link nil
		  :weight 'normal
		  :background nil)
  (set-face-attribute 'org-code nil
		  :foreground "#a9a1e1"
		  :background nil)
  (set-face-attribute 'org-date nil
		  :foreground "#5B6268"
		  :background nil)
  (set-face-attribute 'org-level-1 nil
		  :foreground "steelblue2"
		  :background nil
		  :height 1.1
		  :weight 'normal)
  (set-face-attribute 'org-level-2 nil
		  :foreground "slategray2"
		  :background nil
		  :height 1.0
		  :weight 'normal)
  (set-face-attribute 'org-level-3 nil
		  :foreground "SkyBlue2"
		  :background nil
		  :height 1.0
		  :weight 'normal)
  (set-face-attribute 'org-level-4 nil
		  :foreground "DodgerBlue2"
		  :background nil
		  :height 1.0
		  :weight 'normal)
  (set-face-attribute 'org-level-5 nil
		  :weight 'normal)
  (set-face-attribute 'org-level-6 nil
		  :weight 'normal)
  (set-face-attribute 'org-document-title nil
		  :foreground "SlateGray1"
		  :background nil
		  :height 1.25
		  :weight 'bold)

  (setq org-list-demote-modify-bullet (quote (("+" . "-")
					  ("*" . "-")
					  ("1." . "-")
					  ("1)" . "-")
					  ("A)" . "-")
					  ("B)" . "-")
					  ("a)" . "-")
					  ("b)" . "-")
					  ("A." . "-")
					  ("B." . "-")
					  ("a." . "-")
					  ("b." . "-"))))
)

;; (use-package org-noter :ensure t)
;; (use-package org-appear :ensure t)
(use-package org-superstar
  :ensure t
  :after org
  :hook (org-mode . org-superstar-mode)
  :config
  (set-face-attribute 'org-superstar-header-bullet nil :inherit 'fixed-pitched :height 180)
  :custom
  (org-superstar-headline-bullets-list '("☀" "☪" "☯" "✿" "→"))
  (setq org-ellipsis " ▼ "))

(use-package org-download :ensure t)

(use-package org-journal
  :ensure t
  :defer t
  :init
  (add-to-list 'magic-mode-alist '(+org-journal-p . org-journal-mode))

  (defun +org-journal-p ()
    "Wrapper around `org-journal-is-journal' to lazy load `org-journal'."
    (when-let (buffer-file-name (buffer-file-name (buffer-base-buffer)))
      (if (or (featurep 'org-journal)
              (and (file-in-directory-p
                    buffer-file-name (expand-file-name org-journal-dir org-directory))
                   (require 'org-journal nil t)))
          (org-journal-is-journal))))

  (setq org-journal-dir (dropbox-path "org/journal/")
        org-journal-cache-file (dropbox-path "org/journal/"))

  :config
  ;; Remove the orginal journal file detector and rely on `+org-journal-p'
  ;; instead, to avoid loading org-journal until the last possible moment.
  (setq magic-mode-alist (assq-delete-all 'org-journal-is-journal magic-mode-alist))

  ;; Setup carryover to include all configured TODO states. We cannot carry over
  ;; [ ] keywords because `org-journal-carryover-items's syntax cannot correctly
  ;; interpret it as anything other than a date.
  (setq org-journal-carryover-items  "TODO=\"TODO\"|TODO=\"PROJ\"|TODO=\"STRT\"|TODO=\"WAIT\"|TODO=\"HOLD\""))

(use-package org-pomodoro
  :ensure t
  :config
  (with-eval-after-load 'org-pomodoro
    ;; prefer PulseAudio to ALSA in $current_year
    (setq org-pomodoro-audio-player (or (executable-find "paplay")
					org-pomodoro-audio-player))

    ;; configure pomodoro alerts to use growl or libnotify
    (alert-add-rule :category "org-pomodoro"
		    :style (cond (alert-growl-command
				  'growl)
				 (alert-notifier-command
				  'notifier)
				 (alert-libnotify-command
				  'libnotify)
				 (alert-default-style)))))

(use-package elfeed-org
   :config
      (setq rmh-elfeed-org-files (list
			      (concat org-directory "/elfeed1.org")
			      (concat org-directory "/elfeed2.org")))
  (setq elfeed-db-directory (concat org-directory "/elfeed/db/"))
  (setq elfeed-enclosure-default-dir (concat org-directory "/elfeed/enclosures/"))
  (setq elfeed-search-filter "@3-month-ago +unread")
)

(use-package ox-reveal
  :init
  (setq org-reveal-root (dropbox-path "shared/ppt/reveal.js"))
  (setq org-reveal-postamble "Xing Wenju"))

(use-package org
	:config
	(setq org-reverse-note-order t)
	(setq org-refile-use-outline-path nil)
	(setq org-refile-allow-creating-parent-nodes 'confirm)
	(setq org-refile-use-cache nil)
	(setq org-refile-targets '((org-agenda-files . (:maxlevel . 3))))
	(setq org-blank-before-new-entry nil)
)
